DataProcessors/ИнтеграцияВидеоконференций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияВидеоконференций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСервиса</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиВидеоконференций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ИнтеграцияВидеоконференций/Ext/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область Интерфейс

// См. ВидеоконференцииВнутренний.ЗаполнитьИспользуемыеСервисы
Процедура ПриЗаполненииИспользуемыхСервисов(ИспользуемыеСервисы, ТолькоНастраиваемые) Экспорт
	
	Если Не ТолькоНастраиваемые И ВидеоконференцииСлужебный.ДоступныВнешниеПользователиСистемыВзаимодействия() Тогда
		ИспользуемыеСервисы.Добавить(Сервис());
	КонецЕсли;
	
КонецПроцедуры

// См. ВидеоконференцииВнутренний.ЗаполнитьДанныеСервисов
Процедура ПриЗаполненииДанныхСервисов(ДанныеСервисов) Экспорт
	
	ДанныеСервиса = ВидеоконференцииСлужебный.НовыеДанныеСервиса();
	
	ДанныеСервиса.Имя = "Обсуждения";
	ДанныеСервиса.Представление = НСтр("ru = 'Встроенный сервис «Обсуждения»'");
	ДанныеСервиса.Картинка = БиблиотекаКартинок.МониторПортала1СИТСЛоготип;
	ДанныеСервиса.ДоступенЧат = Истина;
	ДанныеСервиса.ЭтоСистемаВзаимодействия = Истина;
	ДанныеСервиса.УчетнаяЗаписьПоУмолчанию = УчетнаяЗаписьСервиса();
	
	ДанныеСервиса.Авторизация.НеТребуется = Истина;
	
	ДанныеСервиса.НастройкиОтображения.Кнопки.Старт.Использование = Истина;
	ДанныеСервиса.НастройкиОтображения.Кнопки.Старт.Заголовок = НСтр("ru = 'Начать'");
	
	ДанныеСервиса.НастройкиОтображения.Кнопки.Перейти.Использование = Истина;
	ДанныеСервиса.НастройкиОтображения.Кнопки.Перейти.Заголовок = НСтр("ru = 'Перейти в чат'");
	
	ДанныеСервиса.НастройкиОтображения.Кнопки.Запланировать.Использование = Истина;
	ДанныеСервиса.НастройкиОтображения.Кнопки.Запланировать.Заголовок = НСтр("ru = 'Создать чат'");
	
	ДанныеСервиса.НастройкиОтображения.Кнопки.Отменить.Использование = Истина;
	ДанныеСервиса.НастройкиОтображения.Кнопки.Отменить.Заголовок = НСтр("ru = 'Удалить чат'");
	
	ДанныеСервисов.Вставить(Сервис(), ДанныеСервиса);
	
КонецПроцедуры

// См. ВидеоконференцииВнутренний.ЗаполнитьДанныеОДоступностиСервисов
Процедура ПриЗаполненииДанныхОДоступностиСервисов(ДанныеОДоступностиСервисов, УчетныеЗаписи) Экспорт
	
	СервисыУчетныхЗаписей = ВидеоконференцииСлужебный.СервисыУчетныхЗаписей(УчетныеЗаписи);
	
	Для Каждого УчетнаяЗапись Из УчетныеЗаписи Цикл
		Если СервисыУчетныхЗаписей[УчетнаяЗапись] = Сервис() Тогда
			ДанныеОДоступности = ВидеоконференцииСлужебный.НовыеДанныеОДоступностиСервиса();
			
			ДанныеОДоступности.Сервис = Сервис();
			ДанныеОДоступности.УчетнаяЗапись = УчетнаяЗапись;
			ДанныеОДоступности.Подключено = Обсуждения.ОбсужденияДоступны();
			
			ДанныеОДоступностиСервисов.Вставить(УчетнаяЗапись, ДанныеОДоступности);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
Процедура ПриСозданииВидеоконференции(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер();
		
		Результат = Менеджер.СоздатьВидеоконференцию(НастройкиВидеоконференции);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
Процедура ПриОбновленииВидеоконференции(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер();
		
		Результат = Менеджер.ОбновитьВидеоконференцию(НастройкиВидеоконференции);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
Процедура ПриПолученииДанныхВидеоконференции(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер();
		
		Результат = Менеджер.ДанныеВидеоконференции(Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
Процедура ПриУдаленииВидеоконференции(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер();
		
		Результат = Менеджер.УдалитьВидеоконференцию(Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - Булево
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
//  ДанныеПользователя  - См. ВидеоконференцииСлужебный.НовыеДанныеПользователя
Процедура ПриОпределенииПользовательЯвляетсяУчастником(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер();
		
		Результат = Менеджер.ПользовательЯвляетсяУчастником(Идентификатор, ДанныеПользователя);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
//  ДанныеПользователя  - См. ВидеоконференцииСлужебный.НовыеДанныеПользователя
Процедура ПриДобавленииПользователяВУчастники(УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя) Экспорт
	
	Если Сервис = Сервис() Тогда
		Менеджер = НовыйМенеджер();
		
		Менеджер.ДобавитьПользователяВУчастники(Идентификатор, ДанныеПользователя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Сервис()
	
	Возврат "СистемаВзаимодействия";
	
КонецФункции

Функция НовыйМенеджер()
	
	Менеджер = Создать();
	
	Менеджер.Сервис = Сервис();
	
	ДанныеСервиса = Видеоконференции.ДанныеСервиса(Сервис());
	Менеджер.ДанныеСервиса = ДанныеСервиса;
	Менеджер.УчетнаяЗапись = ДанныеСервиса.УчетнаяЗаписьПоУмолчанию;
	
	Возврат Менеджер;
	
КонецФункции

Функция УчетнаяЗаписьСервиса()
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиВидеоконференций.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетныеЗаписиВидеоконференций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиВидеоконференций КАК УчетныеЗаписиВидеоконференций
	|ГДЕ
	|	УчетныеЗаписиВидеоконференций.Сервис = &Сервис
	|	И НЕ УчетныеЗаписиВидеоконференций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Сервис", Сервис());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УчетнаяЗапись = ВыборкаДетальныеЗаписи.Ссылка; // СправочникСсылка.УчетныеЗаписиВидеоконференций
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗаписьОбъект = Справочники.УчетныеЗаписиВидеоконференций.СоздатьЭлемент();
		УчетнаяЗаписьОбъект.Сервис = Сервис();
		УчетнаяЗаписьОбъект.Наименование = НСтр("ru = 'Встроенный сервис «Обсуждения»'");
		
		УчетнаяЗаписьОбъект.Записать();
		
		УчетнаяЗапись = УчетнаяЗаписьОбъект.Ссылка;
	КонецЕсли;
	
	Возврат УчетнаяЗапись;
	
КонецФункции

#КонецОбласти

#КонецЕсли
